Revit 2024 API
ContinuousRail.GetEndExtensionPath Method
 Retrieves the start extension path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<Curve> GetEndExtensionPath()
Visual Basic
Public Function GetEndExtensionPath As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetEndExtensionPath()
Return Value
 The start extension path of the rail.
See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace